# DataFrame : 2차원 데이터(Series 들의 모음)

# 딕셔너리 자료구조를 통해 생성

import pandas as pd

data = {
    '이름' : ['채치수','정대만','송태섭','서태웅','강백호','변덕규','황태산','윤대협'],
    '학교' : ['북산고','북산고','북산고','북산고','북산고','능남고','능남고','능남고'],
    '키' : [197,184,168,187,188,202,188,190],
    '국어' : [90,40,80,40,15,80,55,100],
    '영어' : [85,35,75,60,20,100,65,85],
    '수학' : [100,50,70,70,10,95,45,90],
    '과학' : [95,55,80,75,35,85,40,95],
    '사회' : [85,20,75,80,10,80,35,95],
    'SW특기' : ['Python','Java','JavaScript','','','C','PYTHON','C#']
}

# print(type(data))
# print(data['이름'])

df = pd.DataFrame(data)

# print(df)
# print(df['이름'])

# 여러개의 컬럼 출력시 대괄호 한번 더 감싸기
# print(df[['이름', '키']])


# index 지정시 데이터의 개수가 일치해야함
dfIdx = pd.DataFrame(data, index=['1번','2번','3번','4번','5번','6번','7번','8번'])

# print(dfIdx)
# print(dfIdx[['키','이름']])

# 컬럼지정해서 순서 정하기 가능
dfC = pd.DataFrame(data, columns=['이름','키','학교'])
# print(dfC)
